v2206/multiphase_solverComparison/icoReactingMultiphaseInterFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// settings

scale   0.2;

xMin     0.00;
yMin     0.00;
zMin     0.00;

xMax     0.20;
yMax     0.80;
zMax     0.001;


vertices
(
    ($xMin  $yMin  $zMin)
    ($xMax  $yMin  $zMin)
    ($xMax  $yMax  $zMin)
    ($xMin  $yMax  $zMin)
    ($xMin  $yMin  $zMax)
    ($xMax  $yMin  $zMax)
    ($xMax  $yMax  $zMax)
    ($xMin  $yMax  $zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (128 256 1) 
    simpleGrading ( 1 1 1 )
);


boundary
(
    bottom
    {
        type    wall;
        faces
        (
            (1 5 4 0)
        );
    }
    top
    {
        type    patch;
        faces
        (
            (3 7 6 2)
        );
    }
    left
    {
        type    wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type    wall;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type    empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
        );
    }
);


// vertices
// (
//     (0 0 0)
//     (0.1 0 0)
//     (0.1 0.45 0)
//     (0 0.45 0)
//     (0 0 1)
//     (0.1 0 1)
//     (0.1 0.45 1)
//     (0 0.45 1)
// );

// blocks
// (
//     hex (0 1 2 3 4 5 6 7) (120 180 1) simpleGrading (1 1 1)
// );


// boundary
// (
//     bottom
//     {
//         type    wall;
//         faces
//         (
//             (1 5 4 0)
//         );
//     }
//     top
//     {
//         type    patch;
//         faces
//         (
//             (3 7 6 2)
//         );
//     }
//     left
//     {
//         type    wall;
//         faces
//         (
//             (0 4 7 3)
//         );
//     }
//     right
//     {
//         type    wall;
//         faces
//         (
//             (2 6 5 1)
//         );
//     }
//     frontAndBack
//     {
//         type    empty;
//         faces
//         (
//             (4 5 6 7)
//             (0 1 2 3)
//         );
//     }
// );



// ************************************************************************* //
