v2206/multiphase_solverComparison/icoReactingMultiphaseInterFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    // div(rhoPhi,U)           Gauss linearUpwind grad(U); 
    // // "div\(phi,alpha.*\)"    Gauss vanLeer;
    // // "div\(phir,alpha.*\)"   Gauss linear;

    // // "div\(Yiphir,alpha.*\)" Gauss linear;
    // // "div\(phi,.*\.air.*\)"  Gauss vanLeer;

    // "div\(phi,alpha.*\)"    Gauss interfaceCompression vanLeer 1;
    // "div\(phir,alpha.*\)"   Gauss linear;

    // "div\(Yiphir,alpha.*\)" Gauss linear;
    // "div\(phi,.*\.air.*\)"  Gauss vanLeer;

    // div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    div(phi,T)              Gauss linearUpwind grad(T);

    // div(rhoPhi,epsilon)     Gauss upwind;
    // div(rhoPhi,k)           Gauss upwind;

    default             none;

    div(rhoPhi,U)       Gauss upwind;
    div(phi,omega)      Gauss upwind;
    div(phi,epsilon)    Gauss upwind;
    div(phi,k)          Gauss upwind;
    div(rhoCpPhi,T)       Gauss upwind;
    div(rhoPhi,K)       Gauss upwind;

    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss linear;

    "div\(phi,alpha.*\)"    Gauss vanLeer;
    "div\(phir,alpha.*\)"   Gauss linear;

    "div\(Yiphir,alpha.*\)" Gauss linear;
    "div\(phi,.*\.air.*\)"  Gauss vanLeer;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div((muEff*dev(T(grad(U)))))  Gauss linear;

    div((interpolate(cp)*rhoPhi),T) Gauss upwind;
}

laplacianSchemes
{
    // default         Gauss linear orthogonal;
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    // default         orthogonal;
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh             ;
    Xvapour.air;
    "alpha.*";
}


// ************************************************************************* //
